{
  "vocab": [
    "<PAD>",
    "<SOS>",
    "<EOS>",
    "<UNK>",
    "as",
    "async",
    "await",
    "break",
    "case",
    "catch",
    "class",
    "const",
    "constructor",
    "continue",
    "default",
    "do",
    "else",
    "export",
    "extends",
    "finally",
    "for",
    "from",
    "function",
    "if",
    "import",
    "let",
    "new",
    "promise",
    "return",
    "super",
    "switch",
    "then",
    "this",
    "try",
    "var",
    "while",
    "!",
    "!=",
    "!==",
    "%",
    "&",
    "&&",
    "*",
    "**",
    "+",
    "++",
    ",",
    "-",
    "--",
    ".",
    "/",
    ":",
    ";",
    "<",
    "<<",
    "<=",
    "=",
    "==",
    "===",
    "=>",
    ">",
    ">=",
    ">>",
    "?",
    "^",
    "|",
    "||",
    "~",
    "(",
    ")",
    "{",
    "}",
    "[",
    "]",
    "var0",
    "var1",
    "var2",
    "var3",
    "var4",
    "var5",
    "var6",
    "var7",
    "var8",
    "var9",
    "tmp0",
    "tmp1",
    "tmp2",
    "tmp3",
    "tmp4",
    "tmp5",
    "tmp6",
    "tmp7",
    "tmp8",
    "tmp9",
    "val0",
    "val1",
    "val2",
    "val3",
    "val4",
    "val5",
    "val6",
    "val7",
    "val8",
    "val9",
    "data0",
    "data1",
    "data2",
    "data3",
    "data4",
    "data5",
    "data6",
    "data7",
    "data8",
    "data9",
    "result0",
    "result1",
    "result2",
    "result3",
    "result4",
    "result5",
    "result6",
    "result7",
    "result8",
    "result9",
    "item0",
    "item1",
    "item2",
    "item3",
    "item4",
    "item5",
    "item6",
    "item7",
    "item8",
    "item9",
    "a",
    "b",
    "c",
    "d",
    "e",
    "f",
    "g",
    "h",
    "i",
    "j",
    "k",
    "l",
    "m",
    "n",
    "o",
    "p",
    "q",
    "r",
    "s",
    "t",
    "u",
    "v",
    "w",
    "x",
    "y",
    "z"
  ],
  "vocab_size": 160
}